<?php
//1. 반복문을 이용해서 아래와 같이 출력해 주세요.
//갯수는 내가 입력한 갯수만큼

// *
// **
// ***
// ****
// *****

// for ($i=1; $i <= 5 ; $i--) 
// { 
//     echo "*\n";
//     while ($i < 5);
// };

// $i = 1;
// do
// {
//     $j = $i * 1;
//     $j = $i * 2;
//     $j = $i * 3;
//     $j = $i * 4;
//     $j = $i * 5;
//     echo "*\n";
//     while ($j <= 5);
// }

// if문 사용한 별만들기
// for ($i=0; $i <=5 ; $i++) 
// { 
//     for ($j=0; $j <= 5 ; $j++) 
//     {
//         if($j < $i)
//         {
//             echo "*";
//         }
//     }
//     echo "\n";
// };

// if 문없이 별만들기
// for ($i=0; $i <= 5; $i++)
// {
//     for ($j = 0; $j < $i; $j++)
//     {
//         echo "*";
//     }
//     echo "\n";
// }

//거꾸로 만들기
// for ($i=5; $i >= 1; $i--)
// {   
//     for ($j = 0; $j < $i; $j++)
//     {
//         echo "*";
//     }
//     echo "\n";
// }

// $num = 5;
// for ($i=1; $i <= $num; $i++)
// {
//     for ($star = $num; $star > $i; $star--)
//     {
//         echo " ";
//     }
//     for ($star = 0; $star < $i; $star++)
//     {
//         echo "*";
//     }
//     echo "\n";
// }

//위 코드를 for문 두개로 해보기
$num = 5;
for ($i=5; $i <= $num; $i--)
{
    for ($star=1; $star <= $i; $star++)
    {
        echo " ";
    }
    echo "*","\n";
}


?>